import "./Careers.css";

export default function ValuesSection() {
  const values = [
    {
      title: "Чесність",
      description:
        "Ми поводимося максимально чесно, прозоро та етично. Ми віримо, що робимо те, що є правильним для наших клієнтів, колег та зацікавлених сторін, навіть коли стикаємося зі складним вибором.",
    },
    {
      title: "Клієнтоорієнтованість",
      description:
        "Наші клієнти є основою всього, що ми робимо. Ми прагнемо розуміти їхні потреби, надавати персоналізовані рішення та забезпечувати винятковий сервіс, що перевершує очікування.",
    },
    {
      title: "Співпраця",
      description:
        "Ми сприяємо створенню спільного та інклюзивного робочого середовища, де цінується командна робота та різноманітність. Використовуючи унікальні сильні сторони та перспективи наших співробітників, ми стимулюємо інновації та досягаємо більшого успіху разом.",
    },
    {
      title: "Інновації",
      description:
        "Ми приймаємо зміни та постійно шукаємо інноваційні рішення для задоволення зростаючих потреб наших клієнтів. Ми заохочуємо наших співробітників мислити творчо, кидати виклик традиціям та досліджувати нові ідеї, щоб визначати майбутнє банківської справи.",
    },
  ];

  return (
    <section className="values-section">
      {values.map((value, index) => (
        <div className="value-item" key={index}>
          <h3 className="value-title">{value.title}</h3>
          <p className="value-description">{value.description}</p>
        </div>
      ))}
    </section>
  );
}
