import InformationCard from "../InformationCard/InformationCard";
import WelcomeToPage from "../WelcomeToPage/WelcomeToPage";
import welcome_security from "../../assets/images/Security-welcome.png";
import FAQ from "../FAQ/FAQ";

export default function Security() {
  return (
    <>
      <WelcomeToPage image={welcome_security}>
        <h1>
          Ваша безпека - це наш{" "}
          <span className="highlight">Головний Пріоритет</span>
        </h1>
        <p>
          У YourBank ми розуміємо, наскільки важливо зберігати вашу фінансову
          інформацію в безпеці. Ми застосовуємо надійні заходи безпеки та
          передові технології для захисту ваших особистих і фінансових даних.
          Будьте впевнені, що коли ви користуєтеся нашими послугами, ваша
          безпека є нашим найвищим пріоритетом.
        </p>
      </WelcomeToPage>
      <h2>
        Як ми <span className="highlight">Захищаємо Вас</span>
      </h2>
      <p className="section-p">
        У YourBank ми надаємо пріоритет безпеці та конфіденційності вашої
        фінансової інформації. Наша найсучасніша технологія шифрування та суворі
        заходи захисту даних гарантують, що ваші активи та транзакції завжди під
        надійним захистом.
      </p>
      <section className="grid-4-items-section">
        <InformationCard icon="📊" title="Безпечна онлайн-банківська платформа">
          Наша онлайн-банківська платформа побудована з кількома рівнями безпеки
          для захисту вашої інформації. Ми використовуємо стандартні протоколи
          шифрування, щоб забезпечити конфіденційність ваших даних та їх захист
          під час передачі.
        </InformationCard>

        <InformationCard icon="🔒" title="Багатофакторна автентифікація">
          Щоб підвищити безпеку вашого онлайн-банкінгу, ми використовуємо
          багатофакторну автентифікацію. Цей додатковий рівень безпеки вимагає
          від вас надання кількох способів ідентифікації, таких як пароль та
          одноразовий код підтвердження для доступу до вашого облікового запису.
        </InformationCard>

        <InformationCard icon="🛡️" title="Моніторинг шахрайства">
          У нас є складні системи виявлення шахрайства для моніторингу ваших
          рахунків на предмет підозрілих дій. Наша спеціалізована команда працює
          цілодобово, щоб виявити та запобігти несанкціонованим транзакціям,
          забезпечуючи ваш спокій.
        </InformationCard>

        <InformationCard icon="📱" title="Безпечний мобільний банкінг">
          Наш мобільний банкінг-додаток розроблений з таким же рівнем безпеки,
          як і наша онлайн-банківська платформа. Ви можете впевнено отримувати
          доступ до своїх рахунків, здійснювати транзакції та керувати фінансами
          в дорозі, знаючи, що ваша інформація надійно захищена.
        </InformationCard>
      </section>
      <FAQ/>
    </>
  );
}
