{
    "tabs": [
      { "id": "online-banking", "label": "Online Banking" },
      { "id": "financial-tools", "label": "Financial Tools" },
      { "id": "customer-support", "label": "Customer Support" }
    ],
    "content": {
      "online-banking": [
        {
          "title": "24/7 Account Access",
          "description": "Enjoy the convenience of accessing your accounts anytime, anywhere through our secure online banking platform. Check balances, transfer funds, and pay bills with ease."
        },
        {
          "title": "Mobile Banking App",
          "description": "Stay connected to your finances on the go with our user-friendly mobile banking app. Easily manage your accounts, deposit checks, and make payments from your smartphone or tablet."
        },
        {
          "title": "Secure Transactions",
          "description": "Rest assured knowing that your transactions are protected by industry-leading security measures. We employ encryption and multi-factor authentication to safeguard your financial information."
        },
        {
          "title": "Bill Pay and Transfers",
          "description": "Save time and avoid late fees with our convenient bill pay service. Set up recurring payments or make one-time transfers between your accounts with just a few clicks."
        }
      ],
      "financial-tools": [
        {
          "title": "Budget Management",
          "description": "Track your spending and set up budgets with our easy-to-use financial tools. Gain insights into your finances and make smarter financial decisions."
        },
        {
          "title": "Investment Insights",
          "description": "Get personalized investment advice to grow your wealth over time. Access market trends and analysis tailored to your financial goals."
        },
        {
          "title": "Tax Calculators",
          "description": "Simplify your tax planning with our tax calculator tools. Estimate returns and maximize your savings with expert recommendations."
        }
      ],
      "customer-support": [
        {
          "title": "24/7 Live Support",
          "description": "Our team is available around the clock to assist you with any questions or concerns. Get real-time help from our experienced customer service representatives."
        },
        {
          "title": "Fraud Protection",
          "description": "Protect your accounts with our fraud prevention tools and dedicated support team. Stay informed and secure with proactive monitoring and alerts."
        },
        {
          "title": "Feedback and Resolution",
          "description": "Share your feedback and get quick resolutions to your issues. We value your input and strive to provide the best customer experience possible."
        }
      ]
    }
  }
  