{
    "tabs": [
      { "id": "online-banking", "label": "Інтернет-банкінг" },
      { "id": "financial-tools", "label": "Фінансові Інструменти" },
      { "id": "customer-support", "label": "Клієнтська Підтримка" }
    ],
    "content": {
      "online-banking": [
        {
          "title": "Доступ до рахунку 24/7",
          "description": "Насолоджуйтесь зручністю доступу до своїх рахунків у будь-який час і з будь-якого місця за допомогою нашої захищеної платформи онлайн-банкінгу. Перевіряйте залишки, переказуйте кошти та сплачуйте рахунки з легкістю."
        },
        {
          "title": "Мобільний додаток",
          "description": "Залишайтеся на зв'язку з вашими фінансами в дорозі за допомогою нашого зручного мобільного банкінгу. Легко керуйте своїми рахунками, депонуйте чеки та здійснюйте платежі зі смартфона або планшета."
        },
        {
          "title": "Безпечні транзакції",
          "description": "Будьте впевнені, знаючи, що ваші транзакції захищені найкращими в галузі заходами безпеки. Ми використовуємо шифрування та багатофакторну автентифікацію для захисту вашої фінансової інформації."
        },
        {
          "title": "Оплата рахунків та перекази",
          "description": "Заощаджуйте час та уникайте штрафів за прострочення з нашим зручним сервісом оплати рахунків. Налаштуйте регулярні платежі або здійснюйте одноразові перекази між своїми рахунками всього за кілька кліків."
        }
      ],
      "financial-tools": [
        {
          "title": "Управління бюджетом",
          "description": "Відстежуйте свої витрати та складайте бюджети за допомогою наших простих у використанні фінансових інструментів. Отримуйте інформацію про свої фінанси та приймайте розумні фінансові рішення."
        },
        {
          "title": "Інвестиційні ідеї",
          "description": "Отримуйте індивідуальні інвестиційні поради, щоб примножити свої статки з часом. Отримуйте доступ до ринкових тенденцій та аналізу, адаптованого до ваших фінансових цілей."
        },
        {
          "title": "Податкові калькулятори",
          "description": "Спростіть своє податкове планування за допомогою нашого податкового калькулятора. Оцініть прибуток і максимізуйте свої заощадження за допомогою рекомендацій експертів."
        }
      ],
      "customer-support": [
        {
          "title": "24/7 Підтримка в режимі реального часу",
          "description": "Наша команда доступна цілодобово, щоб допомогти вам з будь-якими питаннями або проблемами. Отримайте допомогу в режимі реального часу від наших досвідчених представників служби підтримки."
        },
        {
          "title": "Захист від шахрайства",
          "description": "Захистіть свої акаунти за допомогою наших інструментів для запобігання шахрайству та спеціальної команди підтримки. Залишайтеся в курсі подій і будьте в безпеці завдяки проактивному моніторингу та сповіщенням."
        },
        {
          "title": "Зворотній зв'язок та вирішення",
          "description": "Поділіться своїми відгуками та отримайте швидке вирішення ваших проблем. Ми цінуємо ваш внесок і прагнемо забезпечити найкращий клієнтський досвід."
        }
      ]
    }
  }
  