{
  "jobs": [
    {
      "title": "Менеджер з відносин",
      "location": "Індія",
      "department": "Банківське обслуговування",
      "description": "Як менеджер з відносин у YourBank, ви будете відповідати за побудову та підтримку відносин з нашими цінними клієнтами. Ви будете проактивно визначати їхні фінансові потреби та пропонувати індивідуальні рішення для досягнення їхніх цілей.",
      "requirements": [
        "Ступінь бакалавра в галузі бізнесу, фінансів або суміжній сфері",
        "Мінімум 3 роки досвіду роботи у продажах або управлінні відносинами в банківській сфері",
        "Доведений досвід виконання та перевиконання планів продажу",
        "Відмінні міжособистісні та переговорні навички",
        "Глибокі знання банківських продуктів та послуг"
      ]
    },
    {
      "title": "Аналітик ризиків",
      "location": "Індія",
      "department": "Управління ризиками",
      "description": "Як аналітик ризиків у YourBank, ви відіграватимете важливу роль у визначенні та оцінці ризиків для організації.",
      "requirements": [
        "Ступінь бакалавра в галузі фінансів, економіки або суміжній сфері",
        "Мінімум 2 роки досвіду роботи в управлінні ризиками або на подібній посаді",
        "Володіння інструментами та техніками аналізу ризиків",
        "Сильні аналітичні та навички вирішення проблем",
        "Знання регуляторних вимог та передових практик у галузі"
      ]
    },
    {
      "title": "Фахівець з ІТ-безпеки",
      "location": "Індія",
      "department": "Інформаційні технології",
      "description": "Як фахівець з ІТ-безпеки у YourBank, ви будете відповідати за забезпечення безпеки та цілісності наших інформаційних систем.",
      "requirements": [
        "Ступінь бакалавра в галузі комп'ютерних наук, інформаційної безпеки або суміжній сфері",
        "Мінімум 5 років досвіду роботи в ІТ-безпеці або на подібній посаді",
        "Глибокі знання мережевих протоколів безпеки та оцінки вразливостей",
        "Знання регуляторних стандартів, таких як PCI DSS і GDPR",
        "Наявність професійних сертифікатів, таких як CISSP або CISM, є перевагою"
      ]
    }
  ]
}
