{
    "tabs": [
      {
        "id": "individuals",
        "label": "Для фізосіб"
      },
      {
        "id": "businesses",
        "label": "Для бізнесу"
      }
    ],
    "content": {
      "individuals": [
        {
          "icon": "💼",
          "title": "Перевірка рахунків",
          "description": "Насолоджуйтесь легким та зручним доступом до своїх коштів завдяки нашому асортименту чекових рахунків. Скористайтеся такими можливостями, як онлайн- та мобільний банкінг, дебетові картки та безкоштовний доступ до банкоматів."
        },
        {
          "icon": "💰",
          "title": "Заощаджувальні рахунки",
          "description": "Примножуйте свої заощадження за допомогою наших конкурентних відсоткових ставок та гнучких варіантів ощадних рахунків. Незалежно від того, чи заощаджуєте ви на певну мету, чи хочете примножити свої статки з часом, у нас є відповідний рахунок для вас."
        },
        {
          "icon": "🏠",
          "title": "Кредити та іпотека",
          "description": "Здійснюйте свої мрії за допомогою наших гнучких кредитних та іпотечних пропозицій. Від персональних кредитів до іпотеки на житло - наші досвідчені кредитні спеціалісти допоможуть вам оформити заявку та отримати необхідні кошти."
        }
      ],
      "businesses": [
        {
          "icon": "📊",
          "title": "Бізнес-рахунки",
          "description": "Спростіть свої фінанси за допомогою наших спеціалізованих рахунків, призначених як для малого, так і для великого бізнесу."
        },
        {
          "icon": "📈",
          "title": "Бізнес-позики",
          "description": "Розширюйте свій бізнес за допомогою гнучких варіантів фінансування. Незалежно від того, чи потрібен вам оборотний капітал, чи кошти для великих інвестицій, ми завжди готові допомогти."
        },
        {
          "icon": "💳",
          "title": "Корпоративні кредитні картки",
          "description": "Ефективно керуйте своїми витратами з нашими корпоративними кредитними картками. Користуйтеся ексклюзивними перевагами та винагородами, розробленими спеціально для бізнесу."
        }
      ]
    }
  }
  