{
  "tabs": [
    {
      "id": "individuals",
      "label": "Для фізосіб"
    },
    {
      "id": "businesses",
      "label": "Для бізнесу"
    }
  ],
  "content": {
    "individuals": [
      {
        "quote": "YourBank став для мене справжнім порятунком! Їхні програми заощаджень допомогли мені легко досягти фінансових цілей.",
        "author": "Джейн Д"
      },
      {
        "quote": "Додаток для онлайн-банкінгу настільки зручний і безпечний. Я можу керувати всім в одному місці.",
        "author": "Марк Т"
      },
      {
        "quote": "Ніколи не думав, що банківські послуги можуть бути такими зручними. Підтримка клієнтів завжди готова допомогти.",
        "author": "Емілі Г"
      },
      {
        "quote": "Процес отримання кредиту був швидким і прозорим. Рекомендую YourBank для всіх фінансових потреб!",
        "author": "Майкл К"
      },
      {
        "quote": "YourBank допоміг мені створити план бюджету, який ідеально підходить до мого способу життя.",
        "author": "Сара Г"
      },
      {
        "quote": "Інструменти для заощаджень надзвичайно корисні для досягнення моїх довгострокових цілей.",
        "author": "Даніель П"
      },
      {
        "quote": "Я ціную персоналізовані поради, які надають консультанти YourBank.",
        "author": "Ребекка Л"
      },
      {
        "quote": "Їхній мобільний додаток завжди надійний, і я ніколи не хвилююся про безпеку.",
        "author": "Алекс С"
      }
    ],
    "businesses": [
      {
        "quote": "Кредити для бізнесу від YourBank дозволили нам легко розширити операції. Дуже рекомендую!",
        "author": "Анна Б"
      },
      {
        "quote": "Корпоративні кредитні картки YourBank значно полегшили управління витратами для моєї команди.",
        "author": "Девід Р"
      },
      {
        "quote": "Фінансові інструменти YourBank оптимізували наші бухгалтерські процеси. Обов'язково для будь-якого бізнесу!",
        "author": "Софія Л"
      },
      {
        "quote": "Гнучкі фінансові рішення допомогли нам без зусиль отримати важливу інвестиційну можливість.",
        "author": "Джеймс П"
      },
      {
        "quote": "Команда підтримки клієнтів завжди оперативно реагує і допомагає з усіма запитами.",
        "author": "Олівія Ф"
      },
      {
        "quote": "Завдяки YourBank ми змогли відкрити нову філію без фінансових труднощів.",
        "author": "Ітан В"
      },
      {
        "quote": "Їхні онлайн-інструменти ідеально підходять для відстеження та управління витратами бізнесу.",
        "author": "Наталі М"
      },
      {
        "quote": "Ми значно покращили управління грошовими потоками завдяки їхнім експертним порадам.",
        "author": "Ліам Г"
      }
    ]
  }
}
